[ViperKingImmunities X2AbilityTemplate]
LocFriendlyName="毒蛇怪国王免疫"
LocLongDescription="免疫毒素、寄生兽毒液、冰冻和精神攻击。"
LocHelpText="免疫毒素、寄生兽毒液、冰冻和精神攻击。"

[BerserkerQueenImmunities X2AbilityTemplate]
LocFriendlyName="狂战士女王免疫"
LocLongDescription="免疫毒素、寄生兽毒液、击退和精神攻击。"
LocHelpText="免疫毒素、寄生兽毒液、击退和精神攻击。"

[ArchonKingImmunities X2AbilityTemplate]
LocFriendlyName="执政官国王免疫"
LocLongDescription="免疫寄生兽毒液、火焰和精神攻击。"
LocHelpText="免疫寄生兽毒液、火焰和精神攻击。"
